/*:
 # Playground
---
 На прошлом занятии ты познакомился со средой разработки `Xcode` и, наверное, заметил, что в `Xcode` можно создавать особый тип документа - `Playground`. Он предназначен как раз для обучения программированию на языке `Swift`. Если внутри такого документа написать строки программы, то сразу станет видно, что происходит при их работе и при этом не нужно создавать приложение целиком.
 
 Запусти `Xcode` и выбери _Get started with a playground_.
 
 ![Get started with a playground](Playground.GetStarted.png)
 
 При открытии `playground`  ты увидишь в окне две панели. Слева  - редактор, в котором ты будешь писать код, справа - боковая панель, где демонстрируются результаты твоей программы.
 
 ![Playground](Playground.Main.png)
 
Все последующие задания выполняй в этом `playground`.
 
 [Назад: Введение](@previous)  |  Страница 2  |  [Вперед: Типы данных](@next)
 */

